# GetSizeInFloats Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexPositionColored..::..GetSizeInFloats Method
VertexPositionColored Class See Also
---
Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static int GetSizeInFloats()
```

Visual Basic
---
```text
Public Shared Function GetSizeInFloats As Integer
```

Visual C++
---
```text
public:
static int GetSizeInFloats()
```

# ### Return Value
The number of floats occupied by one vertex of this type.
# See Also
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace